; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v3)
             (pred_7 ?v6 ?v8)
             (pred_8 ?v12 ?v8)
             (pred_2 ?v4 ?v12 )
	     (pred_10 ?v12)
             (pred_3 ?v10)
             (pred_4 ?v6)
             (pred_12 ?v8)
             (pred_5 ?v12)
             (pred_1 ?v6)
             (pred_11 ?v12)
             (pred_6 ))



(:action op_2
:parameters (?v11 ?v1 ?v5 ?v9)
:precondition (and (pred_3 ?v11) (pred_3 ?v1) (pred_4 ?v5) (pred_12 ?v9)
          (pred_9 ?v11 ?v1) (pred_7 ?v5 ?v9)
                   (pred_8 ?v1 ?v9) (pred_10 ?v11) 
                   (pred_5 ?v1) (pred_1 ?v5))
:effect (and  (pred_11 ?v1) (not (pred_5 ?v1))))


(:action op_4
:parameters (?v11 ?v7)
:precondition (and (pred_3 ?v11) (pred_3 ?v7)
               (pred_10 ?v11) (pred_9 ?v11 ?v7) (pred_11 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v11))))

(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_3 ?v11) (pred_4 ?v5) 
                  (pred_10 ?v11) (pred_2 ?v5 ?v11) (pred_6 ))
:effect (and (pred_1 ?v5)
   (not (pred_2 ?v5 ?v11)) (not (pred_6 ))))


(:action op_1
:parameters (?v11 ?v13 ?v2)
:precondition (and (pred_3 ?v11) (pred_4 ?v13) (pred_4 ?v2)
                  (pred_10 ?v11) (pred_1 ?v2) (pred_2 ?v13 ?v11))
:effect (and (pred_1 ?v13) (pred_2 ?v2 ?v11)
        (not (pred_1 ?v2)) (not (pred_2 ?v13 ?v11))))

(:action op_5
:parameters (?v11 ?v5)
:precondition (and (pred_3 ?v11) (pred_4 ?v5) 
                  (pred_10 ?v11) (pred_1 ?v5))
:effect (and (pred_6 ) (pred_2 ?v5 ?v11) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_03 obj_05 obj_19 obj_13 obj_02 obj_18 obj_10 obj_15 obj_04 obj_11 obj_06 obj_09 obj_16 obj_14 obj_08
    obj_01 obj_17
    obj_12 obj_07
    )

    (:init
       (pred_6)

       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_12 obj_01)
       (pred_12 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_07)

       (pred_9 obj_20 obj_13)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_18 obj_11)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_18)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_16 obj_14)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_16)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_14)
       (pred_5 obj_19)
       (pred_5 obj_11)
       (pred_8  obj_19 obj_01)
       (pred_8  obj_11 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_14)
       (pred_11 obj_08)

       (pred_7  obj_12 obj_01)
       (pred_7  obj_07 obj_17)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_07 obj_19)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_2 obj_12 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_04)))
)
)

; plan
1. (op_4 obj_16 obj_14)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_14)
   goals met: 0 of 1
2. (op_4 obj_14 obj_08)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_06)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_06)
   goals met: 0 of 1
4. (op_4 obj_06 obj_10)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_18)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_12)
   deleted: (pred_2 obj_12 obj_18) (pred_6)
   added: (pred_1 obj_12)
   goals met: 0 of 1
7. (op_4 obj_18 obj_05)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_05)
   goals met: 0 of 1
8. (op_5 obj_05 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_6) (pred_2 obj_12 obj_05)
   goals met: 1 of 1
